# -*- coding: utf-8 -*-
# @Time    : 2023/4/19 1:02
# @Author  : Monarch
# @File    : Class_landuse.py
# @Software: PyCharm

import os
from glob import glob
import geopandas as gpd
import pandas as pd

os.chdir(r'D:\Data\parper\datasets')
outpath = r'D:\Data\parper\landuse'
files = glob('*.shp')
keys = [
    ['裸土地', '裸岩石砾地', '沙地', '沼泽地'],
    ['建设用地', '其它建设用地', ' 农村建设用地', '农村建设用地', '其他建设用地', '城镇建设用地', '采矿用地', '其他交通用地', '农村道路', '其它交通用地'],
    ['水田', '水浇地', '农田'],
    ['林地', '经果林', '有林地', '灌木林地', '果园', '其它园地', '其他园地', '有林地·', '茶园', '其它林地', '其他林地', '园地', ''],
    ['草地', '其它草地', '旱地', '人工牧草地', '其他草地', '天然牧草地'],
    ['水体', '河湖库塘·', '河湖库塘']
]
land_use = []
for file in files:
    gdf = gpd.read_file(file).to_crs('EPSG:3857')
    gdf.to_file(f'{outpath}/{file}')
    print(file)



"""
['裸土地', '裸岩石砾地', '沙地', '沼泽地']
['其它建设用地', ' 农村建设用地', '农村建设用地', '其他建设用地', '城镇建设用地', '采矿用地']
['水田', '水浇地', '农田']
['经果林', '有林地', '林地', '灌木林地', '果园', '其它园地', '其他园地', '有林地·', '茶园', '其它林地', '其他林地', '园地']
['其它草地', '草地', '旱地', '人工牧草地', '其他草地', '天然牧草地', ]
['其他交通用地', '农村道路', '其它交通用地']
['河湖库塘·', '河湖库塘']
"""


